Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes.ViewExtensionForNeighbourParts Property
 The view extension for neighbour parts.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double ViewExtensionForNeighbourParts { get; set; }
Public Property ViewExtensionForNeighbourParts As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace